========================================================================================================================================================================================================
Layer (type:depth-idx)                                                      Input Shape               Output Shape              Param #                   Kernel Shape              Mult-Adds
========================================================================================================================================================================================================
ResidualEncoderUNet                                                         [2, 1, 64, 256, 256]      [2, 2, 64, 256, 256]      --                        --                        --
├─UNetDecoder: 1-1                                                          --                        --                        (recursive)               --                        --
│    └─ResidualEncoder: 2-1                                                 [2, 1, 64, 256, 256]      [2, 32, 64, 256, 256]     --                        --                        --
│    │    └─StackedConvBlocks: 3-1                                          [2, 1, 64, 256, 256]      [2, 32, 64, 256, 256]     --                        --                        --
│    │    │    └─Sequential: 4-1                                            [2, 1, 64, 256, 256]      [2, 32, 64, 256, 256]     960                       --                        7,516,192,896
│    │    └─Sequential: 3-2                                                 --                        --                        --                        --                        --
│    │    │    └─StackedResidualBlocks: 4-2                                 [2, 32, 64, 256, 256]     [2, 32, 64, 256, 256]     110,976                   --                        928,786,678,272
│    │    │    └─StackedResidualBlocks: 4-3                                 [2, 32, 64, 256, 256]     [2, 64, 32, 128, 128]     390,016                   --                        408,290,329,856
│    │    │    └─StackedResidualBlocks: 4-4                                 [2, 64, 32, 128, 128]     [2, 128, 16, 64, 64]      1,558,272                 --                        204,078,057,984
│    │    │    └─StackedResidualBlocks: 4-5                                 [2, 128, 16, 64, 64]      [2, 256, 8, 32, 32]       6,229,504                 --                        102,022,255,616
│    │    │    └─StackedResidualBlocks: 4-6                                 [2, 256, 8, 32, 32]       [2, 512, 8, 16, 16]       24,910,848                --                        102,013,872,128
├─UNetDecoder: 1-2                                                          [2, 32, 64, 256, 256]     [2, 2, 64, 256, 256]      33,200,576                --                        --
│    └─ModuleList: 2-11                                                     --                        --                        (recursive)               --                        --
│    │    └─ConvTranspose3d: 3-3                                            [2, 512, 8, 16, 16]       [2, 256, 8, 32, 32]       524,544                   [1, 2, 2]                 8,594,128,896
│    └─ModuleList: 2-12                                                     --                        --                        (recursive)               --                        --
│    │    └─StackedConvBlocks: 3-4                                          [2, 512, 8, 32, 32]       [2, 256, 8, 32, 32]       --                        --                        --
│    │    │    └─Sequential: 4-7                                            [2, 512, 8, 32, 32]       [2, 256, 8, 32, 32]       5,309,952                 --                        86,981,478,400
│    └─ModuleList: 2-13                                                     --                        --                        (recursive)               --                        --
│    │    └─Conv3d: 3-5                                                     [2, 256, 8, 32, 32]       [2, 2, 8, 32, 32]         514                       [1, 1, 1]                 8,421,376
│    └─ModuleList: 2-11                                                     --                        --                        (recursive)               --                        --
│    │    └─ConvTranspose3d: 3-6                                            [2, 256, 8, 32, 32]       [2, 128, 16, 64, 64]      262,272                   [2, 2, 2]                 34,376,515,584
│    └─ModuleList: 2-12                                                     --                        --                        (recursive)               --                        --
│    │    └─StackedConvBlocks: 3-7                                          [2, 256, 16, 64, 64]      [2, 128, 16, 64, 64]      --                        --                        --
│    │    │    └─Sequential: 4-8                                            [2, 256, 16, 64, 64]      [2, 128, 16, 64, 64]      1,327,872                 --                        173,979,730,944
│    └─ModuleList: 2-13                                                     --                        --                        (recursive)               --                        --
│    │    └─Conv3d: 3-8                                                     [2, 128, 16, 64, 64]      [2, 2, 16, 64, 64]        258                       [1, 1, 1]                 33,816,576
│    └─ModuleList: 2-11                                                     --                        --                        (recursive)               --                        --
│    │    └─ConvTranspose3d: 3-9                                            [2, 128, 16, 64, 64]      [2, 64, 32, 128, 128]     65,600                    [2, 2, 2]                 68,786,585,600
│    └─ModuleList: 2-12                                                     --                        --                        (recursive)               --                        --
│    │    └─StackedConvBlocks: 3-10                                         [2, 128, 32, 128, 128]    [2, 64, 32, 128, 128]     --                        --                        --
│    │    │    └─Sequential: 4-9                                            [2, 128, 32, 128, 128]    [2, 64, 32, 128, 128]     332,160                   --                        348,026,569,216
│    └─ModuleList: 2-13                                                     --                        --                        (recursive)               --                        --
│    │    └─Conv3d: 3-11                                                    [2, 64, 32, 128, 128]     [2, 2, 32, 128, 128]      130                       [1, 1, 1]                 136,314,880
│    └─ModuleList: 2-11                                                     --                        --                        (recursive)               --                        --
│    │    └─ConvTranspose3d: 3-12                                           [2, 64, 32, 128, 128]     [2, 32, 64, 256, 256]     16,416                    [2, 2, 2]                 137,707,388,928
│    └─ModuleList: 2-12                                                     --                        --                        (recursive)               --                        --
│    │    └─StackedConvBlocks: 3-13                                         [2, 64, 64, 256, 256]     [2, 32, 64, 256, 256]     --                        --                        --
│    │    │    └─Sequential: 4-10                                           [2, 64, 64, 256, 256]     [2, 32, 64, 256, 256]     83,136                    --                        696,321,573,120
│    └─ModuleList: 2-13                                                     --                        --                        (recursive)               --                        --
│    │    └─Conv3d: 3-14                                                    [2, 32, 64, 256, 256]     [2, 2, 64, 256, 256]      66                        [1, 1, 1]                 553,648,128
========================================================================================================================================================================================================
Total params: 74,324,072
Trainable params: 74,324,072
Non-trainable params: 0
Total mult-adds (T): 3.31
========================================================================================================================================================================================================
Input size (MB): 33.55
Forward/backward pass size (MB): 43103.03
Params size (MB): 164.49
Estimated Total Size (MB): 43301.08
========================================================================================================================================================================================================